GopalSaraf/Practicals/PSDL/include/proc/pic16f18424.inc
// Register: SMT1CPWL
#define SMT1CPWL SMT1CPWL
SMT1CPWL                                 equ 0492h
// bitfield definitions
SMT1CPWL_CPW_POSN                        equ 0000h
SMT1CPWL_CPW_POSITION                    equ 0000h
SMT1CPWL_CPW_SIZE                        equ 0008h
SMT1CPWL_CPW_LENGTH                      equ 0008h
SMT1CPWL_CPW_MASK                        equ 00FFh
SMT1CPWL_CPW0_POSN                       equ 0000h
SMT1CPWL_CPW0_POSITION                   equ 0000h
SMT1CPWL_CPW0_SIZE                       equ 0001h
SMT1CPWL_CPW0_LENGTH                     equ 0001h
SMT1CPWL_CPW0_MASK                       equ 0001h
SMT1CPWL_CPW1_POSN                       equ 0001h
SMT1CPWL_CPW1_POSITION                   equ 0001h
SMT1CPWL_CPW1_SIZE                       equ 0001h
SMT1CPWL_CPW1_LENGTH                     equ 0001h
SMT1CPWL_CPW1_MASK                       equ 0002h
SMT1CPWL_CPW2_POSN                       equ 0002h
SMT1CPWL_CPW2_POSITION                   equ 0002h
SMT1CPWL_CPW2_SIZE                       equ 0001h
SMT1CPWL_CPW2_LENGTH                     equ 0001h
SMT1CPWL_CPW2_MASK                       equ 0004h
SMT1CPWL_CPW3_POSN                       equ 0003h
SMT1CPWL_CPW3_POSITION                   equ 0003h
SMT1CPWL_CPW3_SIZE                       equ 0001h
SMT1CPWL_CPW3_LENGTH                     equ 0001h
SMT1CPWL_CPW3_MASK                       equ 0008h
SMT1CPWL_CPW4_POSN                       equ 0004h
SMT1CPWL_CPW4_POSITION                   equ 0004h
SMT1CPWL_CPW4_SIZE                       equ 0001h
SMT1CPWL_CPW4_LENGTH                     equ 0001h
SMT1CPWL_CPW4_MASK                       equ 0010h
SMT1CPWL_CPW5_POSN                       equ 0005h
SMT1CPWL_CPW5_POSITION                   equ 0005h
SMT1CPWL_CPW5_SIZE                       equ 0001h
SMT1CPWL_CPW5_LENGTH                     equ 0001h
SMT1CPWL_CPW5_MASK                       equ 0020h
SMT1CPWL_CPW6_POSN                       equ 0006h
SMT1CPWL_CPW6_POSITION                   equ 0006h
SMT1CPWL_CPW6_SIZE                       equ 0001h
SMT1CPWL_CPW6_LENGTH                     equ 0001h
SMT1CPWL_CPW6_MASK                       equ 0040h
SMT1CPWL_CPW7_POSN                       equ 0007h
SMT1CPWL_CPW7_POSITION                   equ 0007h
SMT1CPWL_CPW7_SIZE                       equ 0001h
SMT1CPWL_CPW7_LENGTH                     equ 0001h
SMT1CPWL_CPW7_MASK                       equ 0080h
SMT1CPWL_SMT1CPW_POSN                    equ 0000h
SMT1CPWL_SMT1CPW_POSITION                equ 0000h
SMT1CPWL_SMT1CPW_SIZE                    equ 0008h
SMT1CPWL_SMT1CPW_LENGTH                  equ 0008h
SMT1CPWL_SMT1CPW_MASK                    equ 00FFh
SMT1CPWL_SMT1CPW0_POSN                   equ 0000h
SMT1CPWL_SMT1CPW0_POSITION               equ 0000h
SMT1CPWL_SMT1CPW0_SIZE                   equ 0001h
SMT1CPWL_SMT1CPW0_LENGTH                 equ 0001h
SMT1CPWL_SMT1CPW0_MASK                   equ 0001h
SMT1CPWL_SMT1CPW1_POSN                   equ 0001h
SMT1CPWL_SMT1CPW1_POSITION               equ 0001h
SMT1CPWL_SMT1CPW1_SIZE                   equ 0001h
SMT1CPWL_SMT1CPW1_LENGTH                 equ 0001h
SMT1CPWL_SMT1CPW1_MASK                   equ 0002h
SMT1CPWL_SMT1CPW2_POSN                   equ 0002h
SMT1CPWL_SMT1CPW2_POSITION               equ 0002h
SMT1CPWL_SMT1CPW2_SIZE                   equ 0001h
SMT1CPWL_SMT1CPW2_LENGTH                 equ 0001h
SMT1CPWL_SMT1CPW2_MASK                   equ 0004h
SMT1CPWL_SMT1CPW3_POSN                   equ 0003h
SMT1CPWL_SMT1CPW3_POSITION               equ 0003h
SMT1CPWL_SMT1CPW3_SIZE                   equ 0001h
SMT1CPWL_SMT1CPW3_LENGTH                 equ 0001h
SMT1CPWL_SMT1CPW3_MASK                   equ 0008h
SMT1CPWL_SMT1CPW4_POSN                   equ 0004h
SMT1CPWL_SMT1CPW4_POSITION               equ 0004h
SMT1CPWL_SMT1CPW4_SIZE                   equ 0001h
SMT1CPWL_SMT1CPW4_LENGTH                 equ 0001h
SMT1CPWL_SMT1CPW4_MASK                   equ 0010h
SMT1CPWL_SMT1CPW5_POSN                   equ 0005h
SMT1CPWL_SMT1CPW5_POSITION               equ 0005h
SMT1CPWL_SMT1CPW5_SIZE                   equ 0001h
SMT1CPWL_SMT1CPW5_LENGTH                 equ 0001h
SMT1CPWL_SMT1CPW5_MASK                   equ 0020h
SMT1CPWL_SMT1CPW6_POSN                   equ 0006h
SMT1CPWL_SMT1CPW6_POSITION               equ 0006h
SMT1CPWL_SMT1CPW6_SIZE                   equ 0001h
SMT1CPWL_SMT1CPW6_LENGTH                 equ 0001h
SMT1CPWL_SMT1CPW6_MASK                   equ 0040h
SMT1CPWL_SMT1CPW7_POSN                   equ 0007h
SMT1CPWL_SMT1CPW7_POSITION               equ 0007h
SMT1CPWL_SMT1CPW7_SIZE                   equ 0001h
SMT1CPWL_SMT1CPW7_LENGTH                 equ 0001h
SMT1CPWL_SMT1CPW7_MASK                   equ 0080h

// Register: SMT1CPWH
#define SMT1CPWH SMT1CPWH
SMT1CPWH                                 equ 0493h
// bitfield definitions
SMT1CPWH_CPW_POSN                        equ 0000h
SMT1CPWH_CPW_POSITION                    equ 0000h
SMT1CPWH_CPW_SIZE                        equ 0008h
SMT1CPWH_CPW_LENGTH                      equ 0008h
SMT1CPWH_CPW_MASK                        equ 00FFh
SMT1CPWH_CPW8_POSN                       equ 0000h
SMT1CPWH_CPW8_POSITION                   equ 0000h
SMT1CPWH_CPW8_SIZE                       equ 0001h
SMT1CPWH_CPW8_LENGTH                     equ 0001h
SMT1CPWH_CPW8_MASK                       equ 0001h
SMT1CPWH_CPW9_POSN                       equ 0001h
SMT1CPWH_CPW9_POSITION                   equ 0001h
SMT1CPWH_CPW9_SIZE                       equ 0001h
SMT1CPWH_CPW9_LENGTH                     equ 0001h
SMT1CPWH_CPW9_MASK                       equ 0002h
SMT1CPWH_CPW10_POSN                      equ 0002h
SMT1CPWH_CPW10_POSITION                  equ 0002h
SMT1CPWH_CPW10_SIZE                      equ 0001h
SMT1CPWH_CPW10_LENGTH                    equ 0001h
SMT1CPWH_CPW10_MASK                      equ 0004h
SMT1CPWH_CPW11_POSN                      equ 0003h
SMT1CPWH_CPW11_POSITION                  equ 0003h
SMT1CPWH_CPW11_SIZE                      equ 0001h
SMT1CPWH_CPW11_LENGTH                    equ 0001h
SMT1CPWH_CPW11_MASK                      equ 0008h
SMT1CPWH_CPW12_POSN                      equ 0004h
SMT1CPWH_CPW12_POSITION                  equ 0004h
SMT1CPWH_CPW12_SIZE                      equ 0001h
SMT1CPWH_CPW12_LENGTH                    equ 0001h
SMT1CPWH_CPW12_MASK                      equ 0010h
SMT1CPWH_CPW13_POSN                      equ 0005h
SMT1CPWH_CPW13_POSITION                  equ 0005h
SMT1CPWH_CPW13_SIZE                      equ 0001h
SMT1CPWH_CPW13_LENGTH                    equ 0001h
SMT1CPWH_CPW13_MASK                      equ 0020h
SMT1CPWH_CPW14_POSN                      equ 0006h
SMT1CPWH_CPW14_POSITION                  equ 0006h
SMT1CPWH_CPW14_SIZE                      equ 0001h
SMT1CPWH_CPW14_LENGTH                    equ 0001h
SMT1CPWH_CPW14_MASK                      equ 0040h
SMT1CPWH_CPW15_POSN                      equ 0007h
SMT1CPWH_CPW15_POSITION                  equ 0007h
SMT1CPWH_CPW15_SIZE                      equ 0001h
SMT1CPWH_CPW15_LENGTH                    equ 0001h
SMT1CPWH_CPW15_MASK                      equ 0080h
SMT1CPWH_SMT1CPW_POSN                    equ 0000h
SMT1CPWH_SMT1CPW_POSITION                equ 0000h
SMT1CPWH_SMT1CPW_SIZE                    equ 0008h
SMT1CPWH_SMT1CPW_LENGTH                  equ 0008h
SMT1CPWH_SMT1CPW_MASK                    equ 00FFh
SMT1CPWH_SMT1CPW8_POSN                   equ 0000h
SMT1CPWH_SMT1CPW8_POSITION               equ 0000h
SMT1CPWH_SMT1CPW8_SIZE                   equ 0001h
SMT1CPWH_SMT1CPW8_LENGTH                 equ 0001h
SMT1CPWH_SMT1CPW8_MASK                   equ 0001h
SMT1CPWH_SMT1CPW9_POSN                   equ 0001h
SMT1CPWH_SMT1CPW9_POSITION               equ 0001h
SMT1CPWH_SMT1CPW9_SIZE                   equ 0001h
SMT1CPWH_SMT1CPW9_LENGTH                 equ 0001h
SMT1CPWH_SMT1CPW9_MASK                   equ 0002h
SMT1CPWH_SMT1CPW10_POSN                  equ 0002h
SMT1CPWH_SMT1CPW10_POSITION              equ 0002h
SMT1CPWH_SMT1CPW10_SIZE                  equ 0001h
SMT1CPWH_SMT1CPW10_LENGTH                equ 0001h
SMT1CPWH_SMT1CPW10_MASK                  equ 0004h
SMT1CPWH_SMT1CPW11_POSN                  equ 0003h
SMT1CPWH_SMT1CPW11_POSITION              equ 0003h
SMT1CPWH_SMT1CPW11_SIZE                  equ 0001h
SMT1CPWH_SMT1CPW11_LENGTH                equ 0001h
SMT1CPWH_SMT1CPW11_MASK                  equ 0008h
SMT1CPWH_SMT1CPW12_POSN                  equ 0004h
SMT1CPWH_SMT1CPW12_POSITION              equ 0004h
SMT1CPWH_SMT1CPW12_SIZE                  equ 0001h
SMT1CPWH_SMT1CPW12_LENGTH                equ 0001h
SMT1CPWH_SMT1CPW12_MASK                  equ 0010h
SMT1CPWH_SMT1CPW13_POSN                  equ 0005h
SMT1CPWH_SMT1CPW13_POSITION              equ 0005h
SMT1CPWH_SMT1CPW13_SIZE                  equ 0001h
SMT1CPWH_SMT1CPW13_LENGTH                equ 0001h
SMT1CPWH_SMT1CPW13_MASK                  equ 0020h
SMT1CPWH_SMT1CPW14_POSN                  equ 0006h
SMT1CPWH_SMT1CPW14_POSITION              equ 0006h
SMT1CPWH_SMT1CPW14_SIZE                  equ 0001h
SMT1CPWH_SMT1CPW14_LENGTH                equ 0001h
SMT1CPWH_SMT1CPW14_MASK                  equ 0040h
SMT1CPWH_SMT1CPW15_POSN                  equ 0007h
SMT1CPWH_SMT1CPW15_POSITION              equ 0007h
SMT1CPWH_SMT1CPW15_SIZE                  equ 0001h
SMT1CPWH_SMT1CPW15_LENGTH                equ 0001h
SMT1CPWH_SMT1CPW15_MASK                  equ 0080h

