GopalSaraf/Practicals/PSDL/include/proc/pic16f18424.inc
// Register: TOSL
#define TOSL TOSL
TOSL                                     equ 01FEEh
// bitfield definitions
TOSL_TOSL_POSN                           equ 0000h
TOSL_TOSL_POSITION                       equ 0000h
TOSL_TOSL_SIZE                           equ 0008h
TOSL_TOSL_LENGTH                         equ 0008h
TOSL_TOSL_MASK                           equ 00FFh
TOSL_TOSL0_POSN                          equ 0000h
TOSL_TOSL0_POSITION                      equ 0000h
TOSL_TOSL0_SIZE                          equ 0001h
TOSL_TOSL0_LENGTH                        equ 0001h
TOSL_TOSL0_MASK                          equ 0001h
TOSL_TOSL1_POSN                          equ 0001h
TOSL_TOSL1_POSITION                      equ 0001h
TOSL_TOSL1_SIZE                          equ 0001h
TOSL_TOSL1_LENGTH                        equ 0001h
TOSL_TOSL1_MASK                          equ 0002h
TOSL_TOSL2_POSN                          equ 0002h
TOSL_TOSL2_POSITION                      equ 0002h
TOSL_TOSL2_SIZE                          equ 0001h
TOSL_TOSL2_LENGTH                        equ 0001h
TOSL_TOSL2_MASK                          equ 0004h
TOSL_TOSL3_POSN                          equ 0003h
TOSL_TOSL3_POSITION                      equ 0003h
TOSL_TOSL3_SIZE                          equ 0001h
TOSL_TOSL3_LENGTH                        equ 0001h
TOSL_TOSL3_MASK                          equ 0008h
TOSL_TOSL4_POSN                          equ 0004h
TOSL_TOSL4_POSITION                      equ 0004h
TOSL_TOSL4_SIZE                          equ 0001h
TOSL_TOSL4_LENGTH                        equ 0001h
TOSL_TOSL4_MASK                          equ 0010h
TOSL_TOSL5_POSN                          equ 0005h
TOSL_TOSL5_POSITION                      equ 0005h
TOSL_TOSL5_SIZE                          equ 0001h
TOSL_TOSL5_LENGTH                        equ 0001h
TOSL_TOSL5_MASK                          equ 0020h
TOSL_TOSL6_POSN                          equ 0006h
TOSL_TOSL6_POSITION                      equ 0006h
TOSL_TOSL6_SIZE                          equ 0001h
TOSL_TOSL6_LENGTH                        equ 0001h
TOSL_TOSL6_MASK                          equ 0040h
TOSL_TOSL7_POSN                          equ 0007h
TOSL_TOSL7_POSITION                      equ 0007h
TOSL_TOSL7_SIZE                          equ 0001h
TOSL_TOSL7_LENGTH                        equ 0001h
TOSL_TOSL7_MASK                          equ 0080h

// Register: TOSH
#define TOSH TOSH
TOSH                                     equ 01FEFh
// bitfield definitions
TOSH_TOSH_POSN                           equ 0000h
TOSH_TOSH_POSITION                       equ 0000h
TOSH_TOSH_SIZE                           equ 0008h
TOSH_TOSH_LENGTH                         equ 0008h
TOSH_TOSH_MASK                           equ 00FFh
TOSH_TOSH0_POSN                          equ 0000h
TOSH_TOSH0_POSITION                      equ 0000h
TOSH_TOSH0_SIZE                          equ 0001h
TOSH_TOSH0_LENGTH                        equ 0001h
TOSH_TOSH0_MASK                          equ 0001h
TOSH_TOSH1_POSN                          equ 0001h
TOSH_TOSH1_POSITION                      equ 0001h
TOSH_TOSH1_SIZE                          equ 0001h
TOSH_TOSH1_LENGTH                        equ 0001h
TOSH_TOSH1_MASK                          equ 0002h
TOSH_TOSH2_POSN                          equ 0002h
TOSH_TOSH2_POSITION                      equ 0002h
TOSH_TOSH2_SIZE                          equ 0001h
TOSH_TOSH2_LENGTH                        equ 0001h
TOSH_TOSH2_MASK                          equ 0004h
TOSH_TOSH3_POSN                          equ 0003h
TOSH_TOSH3_POSITION                      equ 0003h
TOSH_TOSH3_SIZE                          equ 0001h
TOSH_TOSH3_LENGTH                        equ 0001h
TOSH_TOSH3_MASK                          equ 0008h
TOSH_TOSH4_POSN                          equ 0004h
TOSH_TOSH4_POSITION                      equ 0004h
TOSH_TOSH4_SIZE                          equ 0001h
TOSH_TOSH4_LENGTH                        equ 0001h
TOSH_TOSH4_MASK                          equ 0010h
TOSH_TOSH5_POSN                          equ 0005h
TOSH_TOSH5_POSITION                      equ 0005h
TOSH_TOSH5_SIZE                          equ 0001h
TOSH_TOSH5_LENGTH                        equ 0001h
TOSH_TOSH5_MASK                          equ 0020h
TOSH_TOSH6_POSN                          equ 0006h
TOSH_TOSH6_POSITION                      equ 0006h
TOSH_TOSH6_SIZE                          equ 0001h
TOSH_TOSH6_LENGTH                        equ 0001h
TOSH_TOSH6_MASK                          equ 0040h
TOSH_TOSH7_POSN                          equ 0007h
TOSH_TOSH7_POSITION                      equ 0007h
TOSH_TOSH7_SIZE                          equ 0001h
TOSH_TOSH7_LENGTH                        equ 0001h
TOSH_TOSH7_MASK                          equ 0080h

/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 07FFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 07Fh)
#endif
#define ABDEN                            BANKMASK(BAUD1CON), 0
#define ABDOVF                           BANKMASK(BAUD1CON), 7
#define ACC18                            BANKMASK(NCO1ACCU), 2
#define ACC19                            BANKMASK(NCO1ACCU), 3
#define ACKDT                            BANKMASK(SSP1CON2), 5
#define ACKDT1                           BANKMASK(SSP1CON2), 5
#define ACKEN                            BANKMASK(SSP1CON2), 4
#define ACKEN1                           BANKMASK(SSP1CON2), 4
#define ACKSTAT                          BANKMASK(SSP1CON2), 6
#define ACKSTAT1                         BANKMASK(SSP1CON2), 6
#define ACKTIM                           BANKMASK(SSP1CON3), 7
#define ACLR                             BANKMASK(ADCON2), 3
#define ACQ0                             BANKMASK(ADACQL), 0
#define ACQ1                             BANKMASK(ADACQL), 1
#define ACQ10                            BANKMASK(ADACQH), 2
#define ACQ11                            BANKMASK(ADACQH), 3
#define ACQ12                            BANKMASK(ADACQH), 4
#define ACQ2                             BANKMASK(ADACQL), 2
#define ACQ3                             BANKMASK(ADACQL), 3
#define ACQ4                             BANKMASK(ADACQL), 4
#define ACQ5                             BANKMASK(ADACQL), 5
#define ACQ6                             BANKMASK(ADACQL), 6
#define ACQ7                             BANKMASK(ADACQL), 7
#define ACQ8                             BANKMASK(ADACQH), 0
#define ACQ9                             BANKMASK(ADACQH), 1
#define ACT0                             BANKMASK(ADACT), 0
#define ACT1                             BANKMASK(ADACT), 1
#define ACT2                             BANKMASK(ADACT), 2
#define ACT3                             BANKMASK(ADACT), 3
#define ACT4                             BANKMASK(ADACT), 4
#define ADACC0                           BANKMASK(ADACCL), 0
#define ADACC1                           BANKMASK(ADACCL), 1
#define ADACC10                          BANKMASK(ADACCH), 2
#define ADACC11                          BANKMASK(ADACCH), 3
#define ADACC12                          BANKMASK(ADACCH), 4
#define ADACC13                          BANKMASK(ADACCH), 5
#define ADACC14                          BANKMASK(ADACCH), 6
#define ADACC15                          BANKMASK(ADACCH), 7
#define ADACC16                          BANKMASK(ADACCU), 0
#define ADACC17                          BANKMASK(ADACCU), 1
#define ADACC2                           BANKMASK(ADACCL), 2
#define ADACC3                           BANKMASK(ADACCL), 3
#define ADACC4                           BANKMASK(ADACCL), 4
#define ADACC5                           BANKMASK(ADACCL), 5
#define ADACC6                           BANKMASK(ADACCL), 6
#define ADACC7                           BANKMASK(ADACCL), 7
#define ADACC8                           BANKMASK(ADACCH), 0
#define ADACC9                           BANKMASK(ADACCH), 1
#define ADACLR                           BANKMASK(ADCON2), 3
#define ADACQ0                           BANKMASK(ADACQL), 0
#define ADACQ1                           BANKMASK(ADACQL), 1
#define ADACQ10                          BANKMASK(ADACQH), 2
#define ADACQ11                          BANKMASK(ADACQH), 3
#define ADACQ12                          BANKMASK(ADACQH), 4
#define ADACQ2                           BANKMASK(ADACQL), 2
#define ADACQ3                           BANKMASK(ADACQL), 3
#define ADACQ4                           BANKMASK(ADACQL), 4
#define ADACQ5                           BANKMASK(ADACQL), 5
#define ADACQ6                           BANKMASK(ADACQL), 6
#define ADACQ7                           BANKMASK(ADACQL), 7
#define ADACQ8                           BANKMASK(ADACQH), 0
#define ADACQ9                           BANKMASK(ADACQH), 1
#define ADACT0                           BANKMASK(ADACT), 0
#define ADACT1                           BANKMASK(ADACT), 1
#define ADACT2                           BANKMASK(ADACT), 2
#define ADACT3                           BANKMASK(ADACT), 3
#define ADACT4                           BANKMASK(ADACT), 4
#define ADACTPPS0                        BANKMASK(ADACTPPS), 0
#define ADACTPPS1                        BANKMASK(ADACTPPS), 1
#define ADACTPPS2                        BANKMASK(ADACTPPS), 2
#define ADACTPPS3                        BANKMASK(ADACTPPS), 3
#define ADACTPPS4                        BANKMASK(ADACTPPS), 4
#define ADAOV                            BANKMASK(ADSTAT), 7
#define ADCALC0                          BANKMASK(ADCON3), 4
#define ADCALC1                          BANKMASK(ADCON3), 5
#define ADCALC2                          BANKMASK(ADCON3), 6
#define ADCAP0                           BANKMASK(ADCAP), 0
#define ADCAP1                           BANKMASK(ADCAP), 1
#define ADCAP2                           BANKMASK(ADCAP), 2
#define ADCAP3                           BANKMASK(ADCAP), 3
#define ADCAP4                           BANKMASK(ADCAP), 4
#define ADCMD                            BANKMASK(PMD3), 5
#define ADCNT0                           BANKMASK(ADCNT), 0
#define ADCNT1                           BANKMASK(ADCNT), 1
#define ADCNT2                           BANKMASK(ADCNT), 2
#define ADCNT3                           BANKMASK(ADCNT), 3
#define ADCNT4                           BANKMASK(ADCNT), 4
#define ADCNT5                           BANKMASK(ADCNT), 5
#define ADCNT6                           BANKMASK(ADCNT), 6
#define ADCNT7                           BANKMASK(ADCNT), 7
#define ADCONT                           BANKMASK(ADCON0), 6
#define ADCRS0                           BANKMASK(ADCON2), 4
#define ADCRS1                           BANKMASK(ADCON2), 5
#define ADCRS2                           BANKMASK(ADCON2), 6
#define ADCS                             BANKMASK(ADCON0), 4
#define ADCS0                            BANKMASK(ADCLK), 0
#define ADCS1                            BANKMASK(ADCLK), 1
#define ADCS2                            BANKMASK(ADCLK), 2
#define ADCS3                            BANKMASK(ADCLK), 3
#define ADCS4                            BANKMASK(ADCLK), 4
#define ADCS5                            BANKMASK(ADCLK), 5
#define ADDEN                            BANKMASK(RC1STA), 3
#define ADDSEN                           BANKMASK(ADCON1), 0
#define ADERR0                           BANKMASK(ADERRL), 0
#define ADERR1                           BANKMASK(ADERRL), 1
#define ADERR10                          BANKMASK(ADERRH), 2
#define ADERR11                          BANKMASK(ADERRH), 3
#define ADERR12                          BANKMASK(ADERRH), 4
#define ADERR13                          BANKMASK(ADERRH), 5
#define ADERR14                          BANKMASK(ADERRH), 6
#define ADERR15                          BANKMASK(ADERRH), 7
#define ADERR2                           BANKMASK(ADERRL), 2
#define ADERR3                           BANKMASK(ADERRL), 3
#define ADERR4                           BANKMASK(ADERRL), 4
#define ADERR5                           BANKMASK(ADERRL), 5
#define ADERR6                           BANKMASK(ADERRL), 6
#define ADERR7                           BANKMASK(ADERRL), 7
#define ADERR8                           BANKMASK(ADERRH), 0
#define ADERR9                           BANKMASK(ADERRH), 1
#define ADFLTR0                          BANKMASK(ADFLTRL), 0
#define ADFLTR1                          BANKMASK(ADFLTRL), 1
#define ADFLTR10                         BANKMASK(ADFLTRH), 2
#define ADFLTR11                         BANKMASK(ADFLTRH), 3
#define ADFLTR12                         BANKMASK(ADFLTRH), 4
#define ADFLTR13                         BANKMASK(ADFLTRH), 5
#define ADFLTR14                         BANKMASK(ADFLTRH), 6
#define ADFLTR15                         BANKMASK(ADFLTRH), 7
#define ADFLTR2                          BANKMASK(ADFLTRL), 2
#define ADFLTR3                          BANKMASK(ADFLTRL), 3
#define ADFLTR4                          BANKMASK(ADFLTRL), 4
#define ADFLTR5                          BANKMASK(ADFLTRL), 5
#define ADFLTR6                          BANKMASK(ADFLTRL), 6
#define ADFLTR7                          BANKMASK(ADFLTRL), 7
#define ADFLTR8                          BANKMASK(ADFLTRH), 0
#define ADFLTR9                          BANKMASK(ADFLTRH), 1
#define ADFM0                            BANKMASK(ADCON0), 2
#define ADFVR0                           BANKMASK(FVRCON), 0
#define ADFVR1                           BANKMASK(FVRCON), 1
#define ADGAOE                           BANKMASK(ADCON1), 4
#define ADGBOE                           BANKMASK(ADCON1), 3
#define ADGO                             BANKMASK(ADCON0), 0
#define ADGPOL                           BANKMASK(ADCON1), 5
#define ADIE                             BANKMASK(PIE1), 0
#define ADIF                             BANKMASK(PIR1), 0
#define ADIPEN                           BANKMASK(ADCON1), 6
#define ADLTH0                           BANKMASK(ADLTHL), 0
#define ADLTH1                           BANKMASK(ADLTHL), 1
#define ADLTH10                          BANKMASK(ADLTHH), 2
#define ADLTH11                          BANKMASK(ADLTHH), 3
#define ADLTH12                          BANKMASK(ADLTHH), 4
#define ADLTH13                          BANKMASK(ADLTHH), 5
#define ADLTH14                          BANKMASK(ADLTHH), 6
#define ADLTH15                          BANKMASK(ADLTHH), 7
#define ADLTH2                           BANKMASK(ADLTHL), 2
#define ADLTH3                           BANKMASK(ADLTHL), 3
#define ADLTH4                           BANKMASK(ADLTHL), 4
#define ADLTH5                           BANKMASK(ADLTHL), 5
#define ADLTH6                           BANKMASK(ADLTHL), 6
#define ADLTH7                           BANKMASK(ADLTHL), 7
#define ADLTH8                           BANKMASK(ADLTHH), 0
#define ADLTH9                           BANKMASK(ADLTHH), 1
#define ADLTHR                           BANKMASK(ADSTAT), 5
#define ADMATH                           BANKMASK(ADSTAT), 4
#define ADMD0                            BANKMASK(ADCON2), 0
#define ADMD1                            BANKMASK(ADCON2), 1
#define ADMD2                            BANKMASK(ADCON2), 2
#define ADMSK1                           BANKMASK(SSP1CON2), 1
#define ADMSK11                          BANKMASK(SSP1CON2), 1
#define ADMSK2                           BANKMASK(SSP1CON2), 2
#define ADMSK21                          BANKMASK(SSP1CON2), 2
#define ADMSK3                           BANKMASK(SSP1CON2), 3
#define ADMSK31                          BANKMASK(SSP1CON2), 3
#define ADMSK4                           BANKMASK(SSP1CON2), 4
#define ADMSK41                          BANKMASK(SSP1CON2), 4
#define ADMSK5                           BANKMASK(SSP1CON2), 5
#define ADMSK51                          BANKMASK(SSP1CON2), 5
#define ADNREF0                          BANKMASK(ADREF), 4
#define ADOEN                            BANKMASK(OSCEN), 2
#define ADON                             BANKMASK(ADCON0), 7
#define ADOR                             BANKMASK(OSCSTAT), 2
#define ADOV                             BANKMASK(ADSTAT), 7
#define ADPCH0                           BANKMASK(ADPCH), 0
#define ADPCH1                           BANKMASK(ADPCH), 1
#define ADPCH2                           BANKMASK(ADPCH), 2
#define ADPCH3                           BANKMASK(ADPCH), 3
#define ADPCH4                           BANKMASK(ADPCH), 4
#define ADPCH5                           BANKMASK(ADPCH), 5
#define ADPPOL                           BANKMASK(ADCON1), 7
#define ADPRE0                           BANKMASK(ADPREL), 0
#define ADPRE1                           BANKMASK(ADPREL), 1
#define ADPRE10                          BANKMASK(ADPREH), 2
#define ADPRE11                          BANKMASK(ADPREH), 3
#define ADPRE12                          BANKMASK(ADPREH), 4
#define ADPRE2                           BANKMASK(ADPREL), 2
#define ADPRE3                           BANKMASK(ADPREL), 3
#define ADPRE4                           BANKMASK(ADPREL), 4
#define ADPRE5                           BANKMASK(ADPREL), 5
#define ADPRE6                           BANKMASK(ADPREL), 6
#define ADPRE7                           BANKMASK(ADPREL), 7
#define ADPRE8                           BANKMASK(ADPREH), 0
#define ADPRE9                           BANKMASK(ADPREH), 1
#define ADPREF0                          BANKMASK(ADREF), 0
#define ADPREF1                          BANKMASK(ADREF), 1
#define ADPREV0                          BANKMASK(ADPREVL), 0
#define ADPREV1                          BANKMASK(ADPREVL), 1
#define ADPREV10                         BANKMASK(ADPREVH), 2
#define ADPREV11                         BANKMASK(ADPREVH), 3
#define ADPREV12                         BANKMASK(ADPREVH), 4
#define ADPREV13                         BANKMASK(ADPREVH), 5
#define ADPREV14                         BANKMASK(ADPREVH), 6
#define ADPREV15                         BANKMASK(ADPREVH), 7
#define ADPREV2                          BANKMASK(ADPREVL), 2
#define ADPREV3                          BANKMASK(ADPREVL), 3
#define ADPREV4                          BANKMASK(ADPREVL), 4
#define ADPREV5                          BANKMASK(ADPREVL), 5
#define ADPREV6                          BANKMASK(ADPREVL), 6
#define ADPREV7                          BANKMASK(ADPREVL), 7
#define ADPREV8                          BANKMASK(ADPREVH), 0
#define ADPREV9                          BANKMASK(ADPREVH), 1
#define ADPSIS                           BANKMASK(ADCON2), 7
#define ADRES0                           BANKMASK(ADRESL), 0
#define ADRES1                           BANKMASK(ADRESL), 1
#define ADRES10                          BANKMASK(ADRESH), 2
#define ADRES11                          BANKMASK(ADRESH), 3
#define ADRES12                          BANKMASK(ADRESH), 4
#define ADRES13                          BANKMASK(ADRESH), 5
#define ADRES14                          BANKMASK(ADRESH), 6
#define ADRES15                          BANKMASK(ADRESH), 7
#define ADRES2                           BANKMASK(ADRESL), 2
#define ADRES3                           BANKMASK(ADRESL), 3
#define ADRES4                           BANKMASK(ADRESL), 4
#define ADRES5                           BANKMASK(ADRESL), 5
#define ADRES6                           BANKMASK(ADRESL), 6
#define ADRES7                           BANKMASK(ADRESL), 7
#define ADRES8                           BANKMASK(ADRESH), 0
#define ADRES9                           BANKMASK(ADRESH), 1
#define ADRPT0                           BANKMASK(ADRPT), 0
#define ADRPT1                           BANKMASK(ADRPT), 1
#define ADRPT2                           BANKMASK(ADRPT), 2
#define ADRPT3                           BANKMASK(ADRPT), 3
#define ADRPT4                           BANKMASK(ADRPT), 4
#define ADRPT5                           BANKMASK(ADRPT), 5
#define ADRPT6                           BANKMASK(ADRPT), 6
#define ADRPT7                           BANKMASK(ADRPT), 7
#define ADSOI                            BANKMASK(ADCON3), 3
#define ADSTAT0                          BANKMASK(ADSTAT), 0
#define ADSTAT1                          BANKMASK(ADSTAT), 1
#define ADSTAT2                          BANKMASK(ADSTAT), 2
#define ADSTPT0                          BANKMASK(ADSTPTL), 0
#define ADSTPT1                          BANKMASK(ADSTPTL), 1
#define ADSTPT10                         BANKMASK(ADSTPTH), 2
#define ADSTPT11                         BANKMASK(ADSTPTH), 3
#define ADSTPT12                         BANKMASK(ADSTPTH), 4
#define ADSTPT13                         BANKMASK(ADSTPTH), 5
#define ADSTPT14                         BANKMASK(ADSTPTH), 6
#define ADSTPT15                         BANKMASK(ADSTPTH), 7
#define ADSTPT2                          BANKMASK(ADSTPTL), 2
#define ADSTPT3                          BANKMASK(ADSTPTL), 3
#define ADSTPT4                          BANKMASK(ADSTPTL), 4
#define ADSTPT5                          BANKMASK(ADSTPTL), 5
#define ADSTPT6                          BANKMASK(ADSTPTL), 6
#define ADSTPT7                          BANKMASK(ADSTPTL), 7
#define ADSTPT8                          BANKMASK(ADSTPTH), 0
#define ADSTPT9                          BANKMASK(ADSTPTH), 1
#define ADTIE                            BANKMASK(PIE1), 1
#define ADTIF                            BANKMASK(PIR1), 1
#define ADTMD0                           BANKMASK(ADCON3), 0
#define ADTMD1                           BANKMASK(ADCON3), 1
#define ADTMD2                           BANKMASK(ADCON3), 2
#define ADUTH0                           BANKMASK(ADUTHL), 0
#define ADUTH1                           BANKMASK(ADUTHL), 1
#define ADUTH10                          BANKMASK(ADUTHH), 2
#define ADUTH11                          BANKMASK(ADUTHH), 3
#define ADUTH12                          BANKMASK(ADUTHH), 4
#define ADUTH13                          BANKMASK(ADUTHH), 5
#define ADUTH14                          BANKMASK(ADUTHH), 6
#define ADUTH15                          BANKMASK(ADUTHH), 7
#define ADUTH2                           BANKMASK(ADUTHL), 2
#define ADUTH3                           BANKMASK(ADUTHL), 3
#define ADUTH4                           BANKMASK(ADUTHL), 4
#define ADUTH5                           BANKMASK(ADUTHL), 5
#define ADUTH6                           BANKMASK(ADUTHL), 6
#define ADUTH7                           BANKMASK(ADUTHL), 7
#define ADUTH8                           BANKMASK(ADUTHH), 0
#define ADUTH9                           BANKMASK(ADUTHH), 1
#define ADUTHR                           BANKMASK(ADSTAT), 6
#define AHEN                             BANKMASK(SSP1CON3), 1
#define ANSA0                            BANKMASK(ANSELA), 0
#define ANSA1                            BANKMASK(ANSELA), 1
#define ANSA2                            BANKMASK(ANSELA), 2
#define ANSA4                            BANKMASK(ANSELA), 4
#define ANSA5                            BANKMASK(ANSELA), 5
#define ANSC0                            BANKMASK(ANSELC), 0
#define ANSC1                            BANKMASK(ANSELC), 1
#define ANSC2                            BANKMASK(ANSELC), 2
#define ANSC3                            BANKMASK(ANSELC), 3
#define ANSC4                            BANKMASK(ANSELC), 4
#define ANSC5                            BANKMASK(ANSELC), 5
#define AS                               BANKMASK(SMT1STAT), 0
#define ASYNC                            BANKMASK(T0CON1), 4
#define BCL1IE                           BANKMASK(PIE3), 1
#define BCL1IF                           BANKMASK(PIR3), 1
#define BF                               BANKMASK(SSP1STAT), 0
#define BF1                              BANKMASK(SSP1STAT), 0
#define BOEN                             BANKMASK(SSP1CON3), 4
#define BORRDY                           BANKMASK(BORCON), 0
#define BRG16                            BANKMASK(BAUD1CON), 3
#define BRGH                             BANKMASK(TX1STA), 2
#define BSR0                             BANKMASK(BSR), 0
#define BSR1                             BANKMASK(BSR), 1
#define BSR2                             BANKMASK(BSR), 2
